# Brewfile as described on https://github.com/mxcl/homebrew/pull/24107

# Install brew-cask subsystem
tap 'caskroom/cask'

# Install homebrew-bundle subsystem
tap 'Homebrew/bundle'

# Tap fonts for powerline font
tap 'caskroom/fonts'

# Install needed formulae
brew 'ant'
brew 'cloc'
brew 'curl'
brew 'dos2unix'
brew 'editorconfig'
brew 'fswatch'
brew 'fzf'
brew 'git'
brew 'heroku'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'macvim', args: ['with-override-system-vim' , 'with-python3']
brew 'mas'
brew 'mysql'
brew 'node6-lts'
brew 'pdfcrack'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'sqlite'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'visionmedia-watch'
brew 'wget'
brew 'z'

# casks
cask 'dash'
cask 'docker'
cask 'font-inconsolata-dz-for-powerline'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'sizeup'
cask 'slack'
cask 'spotify'

# Mac app store
mas '1Password', id: 443987910
mas 'Be Focused Pro', id: 961632517
